In [13]:
import pandas as pd
import numpy as np

## 1. Use the merge function in pandas to join two dataframes together

In [14]:
trades = pd.DataFrame({'ticker': ['MSFT', 'AMZN','GOOG', 'AAPL'],
    'price': [51.95, 51.95, 720.92, 98.00],
    'quantity': [75, 155,162, 100]},
    columns=['ticker', 'price', 'quantity'])
trades

  ticker   price  quantity
0   MSFT   51.95        75
1   AMZN   51.95       155
2   GOOG  720.92       162
3   AAPL   98.00       100

In [15]:
quotes = pd.DataFrame({'ticker': ['GOOG', 'MSFT', 'AAPL', 'AMZN'],
    'bid': [720.50, 51.95, 51.97, 51.99],
    'ask': [720.93, 51.96, 51.98, 52.00]},
    columns=['ticker', 'bid', 'ask'])
quotes

  ticker     bid     ask
0   GOOG  720.50  720.93
1   MSFT   51.95   51.96
2   AAPL   51.97   51.98
3   AMZN   51.99   52.00

In [16]:
merge_col = trades.merge(quotes,how='outer',on='ticker')
merge_col

  ticker   price  quantity     bid     ask
0   MSFT   51.95        75   51.95   51.96
1   AMZN   51.95       155   51.99   52.00
2   GOOG  720.92       162  720.50  720.93
3   AAPL   98.00       100   51.97   51.98

## 2. Use the dataframe.corr to explore correlation relationship in your dataset.

In [17]:
merge_col.corr()

             price  quantity       bid       ask
price     1.000000  0.601659  0.997801  0.997801
quantity  0.601659  1.000000  0.614116  0.614116
bid       0.997801  0.614116  1.000000  1.000000
ask       0.997801  0.614116  1.000000  1.000000

# NBA dataset

In [30]:
nba=pd.read_csv('nba.csv')

In [31]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

## Replace missing values

In [32]:
nba=nba.fillna(0)

In [33]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,0,5000000.0

In [34]:
nba.corr(method='pearson')

          Number       Age    Weight    Salary
Number  1.000000  0.041808  0.211245 -0.107679
Age     0.041808  1.000000  0.178629  0.208051
Weight  0.211245  0.178629  1.000000  0.147616
Salary -0.107679  0.208051  0.147616  1.000000

## Add new feature, Scaled weight

In [35]:
nba['Scaled weight']=nba['Weight']*10

In [36]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Scaled weight
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,1800.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,2350.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0,2050.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,1850.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,0,5000000.0,2310.0

## Replace Team, Position and college with unique integers

In [54]:
  positions=list(nba['Position'].unique())

In [57]:
for i, Position in enumerate(positions):
    nba.replace(Position,i,inplace=True)

In [61]:
teams=list(nba['Team'].unique())

for i,Team in enumerate(teams):
    nba.replace(Team,i,inplace=True)

In [62]:
colleges=list(nba['College'].unique())

for i,College in enumerate(colleges):
    nba.replace(College,i,inplace=True)

In [63]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Scaled weight
0,Avery Bradley,0,4.0,4,25.0,6-2,180.0,0,7730337.0,1800.0
1,Jae Crowder,0,99.0,1,25.0,6-6,235.0,1,6796117.0,2350.0
2,John Holland,0,4.0,2,27.0,6-5,205.0,2,4.0,2050.0
3,R.J. Hunter,0,28.0,2,22.0,6-5,185.0,3,1148640.0,1850.0
4,Jonas Jerebko,0,8.0,3,29.0,6-10,231.0,4,5000000.0,2310.0

## Perform correlation analysis

In [64]:
nba.corr()

,Team,Number,Position,Age,Weight,College,Salary,Scaled weight
Team,1.000000,-0.062932,-0.006827,-0.039102,0.016014,0.288958,0.013412,0.016315
Number,-0.062932,1.000000,0.004979,0.098882,0.218929,-0.099374,-0.096148,0.218688
Position,-0.006827,0.004979,1.000000,0.001068,0.054935,-0.019880,0.064754,0.054518
Age,-0.039102,0.098882,0.001068,1.000000,0.158177,-0.015962,0.031547,0.158650
Weight,0.016014,0.218929,0.054935,0.158177,1.000000,-0.135587,0.147691,0.999985
College,0.288958,-0.099374,-0.019880,-0.015962,-0.135587,1.000000,-0.114929,-0.135033
Salary,0.013412,-0.096148,0.064754,0.031547,0.147691,-0.114929,1.000000,0.147624
Scaled weight,0.016315,0.218688,0.054518,0.158650,0.999985,-0.135033,0.147624,1.000000